Core/src/Documents/РС_НалоговыйДокумент/РС_НалоговыйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РС_НалоговыйДокумент</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияУдостоверение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительНеРезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерАвтомобиля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_НД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНД</name>
    <type>
      <types>EnumRef.РС_СтатусыНД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТранспортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиНД</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.РС_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийНД</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АсинхроннаяНД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНД</name>
    <type>
      <types>EnumRef.РС_ТипыНД</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыТранспортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругойТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяДистрибюций</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикТранспортировкиНД</name>
    <type>
      <types>EnumRef.ПлательщикТранспортировкиТН</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНД</name>
    <type>
      <types>EnumRef.РС_НазначенияНД</types>
    </type>
  </attributes>
  <attributes>
    <name>Получен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДляРС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыЭлНакладных</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>INVOICE_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GOODS_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BARCODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_TXT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY_EXT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EXCISE_AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EXCISE_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_TYPE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EXCISE_UNIT_PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШапкаRS</name>
    <attributes>
      <name>ИмяПараметраRS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметраRS</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/РС_ТипыНД/РС_ТипыНД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_ТипыНД</name>
  <enumValues>
    <name>ВнутреннееПеремещение</name>
    <comment>კოდი 1</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияСТранспортировкой</name>
    <comment>კოდი 2</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияБезТранспортировки</name>
    <comment>კოდი 3</comment>
  </enumValues>
  <enumValues>
    <name>Дистрибуция</name>
    <comment>კოდი 4</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>კოდი 5</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
    <comment>კოდი 6</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/РС_ВидыТранспортировки/РС_ВидыТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_ВидыТранспортировки</name>
  <enumValues>
    <name>Автомобильная</name>
    <comment>(კოდი 1)</comment>
  </enumValues>
  <enumValues>
    <name>Железнодорожная</name>
    <comment>(კოდი 2)</comment>
  </enumValues>
  <enumValues>
    <name>Авиационная</name>
    <comment>(კოდი 3)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(კოდი 4)</comment>
  </enumValues>
  <enumValues>
    <name>Автомобильная_Заграничная</name>
    <comment>(კოდი 6)</comment>
  </enumValues>
  <enumValues>
    <name>Перегрузчик_Автомобильная</name>
    <comment>(კოდი 7)</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/РС_НазначенияНД/РС_НазначенияНД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_НазначенияНД</name>
  <enumValues>
    <name>ДоставкаУслуга</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
    <comment>კოდი 6</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/РС_НалоговыйДокумент/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ГруппаОбщееДеталная.Видимость	= ЗначениеЗаполнено(Объект.НазначениеНД);	
	//ДД
	Элементы.ТоварыНаименованиеДляРС.Видимость = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалНаименованияРС");
	
	Если Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Услуга Тогда	
		Элементы.АдресПогрузки.Видимость = Ложь;	
	Иначе		
		Элементы.АдресПогрузки.Видимость = Истина;		
	КонецЕсли;
	
	Если Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Услуга ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.РеализацияБезТранспортировки  Тогда	
		пБезТранспортировки = Истина;	
	Иначе
		пБезТранспортировки = Ложь;		
	КонецЕсли;
	
	Если Объект.ТипНД = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Дистрибуция  Тогда	
		Элементы.ИнформацияОПолучателе.Видимость = Ложь;	
	Иначе		
		Элементы.ИнформацияОПолучателе.Видимость = Истина;		
	КонецЕсли;
	
	Элементы.ТипНД.Видимость = НЕ Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс;
	
	Прочее = Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Прочее;
	
	Элементы.ГруппаПеревозчика.Видимость = НЕ Прочее И Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
	Элементы.ГруппаТранспортноеСредство.Видимость = НЕ Прочее;		
	Элементы.ГруппаТранспортировка.Видимость = НЕ пБезТранспортировки;
	Элементы.АдресДоставки.Видимость		 = НЕ пБезТранспортировки;
	Элементы.ДругойТранспорт.Видимость 		 = НЕ пБезТранспортировки И Прочее;
	
	ВидимостьТранспорта = ЗначениеЗаполнено(Объект.ВидТранспортировки);
	
	Элементы.ГруппаНачалоТранспортировки.Видимость = ВидимостьТранспорта;
	Элементы.ГруппаКонецТранспортировки.Видимость  = ВидимостьТранспорта;
	Если НЕ ВидимостьТранспорта Тогда		
		Элементы.ГруппаПеревозчика.Видимость           = Ложь;
		Элементы.ГруппаТранспортноеСредство.Видимость  = Ложь;		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	УстановитьВидимостьИДоступность();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("ДокументыОснования") Тогда
		
		Для Каждого ДокументОснование Из Параметры.ДокументыОснования Цикл
			НоваяСтрока = Объект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ДокументОснование;
		КонецЦикла;
		Если Параметры.Свойство("НакладнаяДистрибюций") Тогда 
			Объект.НакладнаяДистрибюций = Параметры.НакладнаяДистрибюций;
			СсылкаЭН = Параметры.СсылкаЭН;
			Объект.ТранспортноеСредство	= СсылкаЭН.ТранспортноеСредство;
			Объект.ГосНомерАвтомобиля	= СсылкаЭН.ГосНомерАвтомобиля;
			Объект.Водитель				= СсылкаЭН.Водитель;
			Объект.НомерУдостоверения	= СсылкаЭН.НомерУдостоверения;
			Объект.ДругойТранспорт      = СсылкаЭН.ДругойТранспорт;
		КонецЕсли;
		ЗапольнитьРеквизитиНакладной(Параметры.ДокументыОснования);
	КонецЕсли;
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, 	Объект.ГрузоПолучатель); //ГрузоПолучатель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, 	Объект.ГрузоОтправитель);//ГрузоОтправитель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, 		Объект.Перевозчик);      //Перевозчик
	СписокДокументыОснования.ЗагрузитьЗначения(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	УстановитьПараметрыВыбора_ТипТН(Истина);
	НазначениеНДПриИзмененииНаСервере();
	
	Массив_Транспорт = Новый Массив;
	Массив_Транспорт.Добавить(ПредопределенноеЗначение("Перечисление.РС_ВидыТранспортировки.Автомобильная"));
	Массив_Транспорт.Добавить(ПредопределенноеЗначение("Перечисление.РС_ВидыТранспортировки.Перегрузчик_Автомобильная"));
	Массив_Транспорт.Добавить(ПредопределенноеЗначение("Перечисление.РС_ВидыТранспортировки.Прочее"));
	
	Элементы.ВидТранспортировки.СписокВыбора.ЗагрузитьЗначения(Массив_Транспорт);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТНПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
	Если Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Дистрибуция") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		КонецЕсли;
		ЗаполнитьЦеныПоДистрибюции();
	ИначеЕсли Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияБезТранспортировки") Тогда
		Объект.АдресДоставки		= "";
		Объект.ВидТранспортировки	= Неопределено;
		Объект.ДругойТранспорт		= "";
		Объект.Перевозчик			= Неопределено;
		ИННПеревозчика				= "";
		Объект.НомерУдостоверения	= "";
		Объект.Водитель				= "";
		Объект.ТранспортноеСредство = "";
		Объект.ГосНомерАвтомобиля	= "";
		Объект.Прицеп               = "";
	КонецЕсли;
КонецПроцедуры
 
 
 //<Запольнить Реквизити Накладной>
 //Запольняется таб часть
 &НаСервере
 Процедура ЗапольнитьРеквизитиНакладной(МассивДокументовОснования)
	 
	 //ЗапольнитьЗначенияШапки();
	 Если Объект.ТипНД = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуВозврата(МассивДокументовОснования));
	 ИначеЕсли Объект.ТипНД = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Дистрибуция Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуПеремешения(МассивДокументовОснования));
		Если Объект.ТипНД = Перечисления.РС_ТипыНД.Дистрибуция Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
			ЗаполнитьЦеныПоДистрибюции();
		КонецЕсли;
	 Иначе
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуРеализации(МассивДокументовОснования));
	 КонецЕсли;
	 //Записать();Паганини
	 
	 ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 ДокументОбъект.СформироватьТаблицуЭлНакладных();
	 ДокументОбъект.СформироватьТаблицуШапкаRS();
	 ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	 Записать();//Паганини
 
 КонецПроцедуры // ()


&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;

	Объект.Товары.Очистить(); 
	ЗапольнитьРеквизитиНакладной(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ТекстВопроса = Нстр("ka='შევსებამდე გასუფთავდება არსებული საქონლის ცხრილი. გაგრძელდეს?';ru='Перед заполнением очистится табличная часть Товары. Продолжить?';en='Before filling cleared tabular section Goods. Proceed?'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе 
		ЗаполнитьТоварыНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе 
		ЗаполнитьТоварыНаСервере();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, Объект.ГрузоОтправитель);
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, Объект.ГрузоПолучатель);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	Если ТипЗнч(Объект.ТранспортноеСредство) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		Объект.ГосНомерАвтомобиля = Объект.ТранспортноеСредство.Код;
		ОсновнойВодитель = Объект.ТранспортноеСредство.ОсновнойВодитель;
		Если ЗначениеЗаполнено(ОсновнойВодитель) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
				Объект.Водитель 			= ОсновнойВодитель;
				Объект.НомерУдостоверения 	= ОсновнойВодитель.ИНН;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	
	Объект.НомерУдостоверения = Объект.Водитель.ИНН;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();	
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура Операция_ЭлНакладная(КомандаТН)
	
	ОчиститьСообщения();//Паганини
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		Если Не Объект.РучнаяКорректировка Тогда 
			ОбновитьДанныеОтправкиНаСервере();
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		КонецЕсли; 
	КонецЕсли;
	
	Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюНД(КомандаТН, Объект);
	Если Не Результат = 0 Тогда 
		Сообщить(Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруЭлНакладных()
	
	Возврат Документы.РС_ЭлектроннаяНакладная.ПолучитьСтруктуруЭлНакладных(Объект.Ссылка);
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеОтправкиНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СформироватьТаблицуЭлНакладных();
	ДокументОбъект.СформироватьТаблицуШапкаRS();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОтправки(Команда)
	ОбновитьДанныеОтправкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Если ЗначениеЗаполнено(Объект.ID_НД) Тогда
		Операция_ЭлНакладная(Команда.Имя);
		Прочитать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьИД(Команда)
	Элементы.ID_НД.ТолькоПросмотр = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная("СоздатьИАктивироватьТН");
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИАктивироватьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

//Паганини
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма / ТекДанные.Количество, 2));
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения 	= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
	ТекДанные.СтавкаНДС 		= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "СтавкаНДС");
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизита(Ссылка, ИмяРеквизита)
	Возврат Ссылка[ИмяРеквизита];
КонецФункции

&НаКлиенте
Процедура ВидТранспортировкиПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, Объект.Перевозчик);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ПолеИНН, Контрагент)
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПолеИНН = Контрагент.ИНН;
	Иначе
		ПолеИНН = "";
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	ЗаполнитьЦеныПоДистрибюции();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоДистрибюции()
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл 
		РС_ОбщегоНазначения.ЗаполнитьЦену(СтрокаТЧ, Объект.ВидЦены);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора_ТипТН(ПриОткрытии = Ложь)
	
	Если СписокДокументыОснования.Количество() = 0 Тогда
		Объект.ДокументыОснования.Очистить();
		Возврат;
	КонецЕсли;
	ТипЗнченияДокумента = ТипЗнч(СписокДокументыОснования[0].Значение);
	
	Массив_ТипТН = Новый Массив;
	Массив_Назначения = Новый Массив;
	
	Если Объект.Получен Тогда
		
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВнутреннееПеремещение"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Дистрибуция"));		
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВозвратОтПокупателя"));		
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияБезТранспортировки"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияСТранспортировкой"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Услуга"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Аванс"));
		Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.Аванс"));		
		Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.ДоставкаУслуга"));
		
	Иначе
		Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВнутреннееПеремещение"));
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Дистрибуция"));
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВозвратОтПокупателя"));
		Иначе
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияБезТранспортировки"));
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияСТранспортировкой"));
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Услуга"));
			//Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Аванс"));
			Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.Аванс"));
		КонецЕсли;
		
		Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.ДоставкаУслуга"));
		
	КонецЕсли;
	
	Элементы.ТипНД.СписокВыбора.ЗагрузитьЗначения(Массив_ТипТН);
	Элементы.НазначениеНД.СписокВыбора.ЗагрузитьЗначения(Массив_Назначения);
	
	Если НЕ ПриОткрытии И Массив_ТипТН.Найти(Объект.ТипНД) = Неопределено Тогда
		Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВнутреннееПеремещение");
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВозвратОтПокупателя");
		Иначе
			Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияСТранспортировкой");
		КонецЕсли;
		УстановитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументыОснованияПриИзменении(Элемент)
	УстановитьПараметрыВыбора_ТипТН();
	Модифицированность = Истина;
КонецПроцедуры

#Область ОбработчикиБиблиотек
// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДокументыОснования.Очистить();
	Для Каждого ЗнДокумента ИЗ СписокДокументыОснования Цикл
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ЗнДокумента.Значение;
	КонецЦикла;
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаСервере
Процедура НазначениеНДПриИзмененииНаСервере()
	
	Если Объект.НазначениеНД = Перечисления.РС_НазначенияНД.ДоставкаУслуга Тогда
		Если Не ЗначениеЗаполнено(Объект.ТипНД) ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс Тогда			
			Объект.ТипНД = Перечисления.РС_ТипыНД.ПустаяСсылка();		
		КонецЕсли;					
	Иначе 		
		Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс;		
	КонецЕсли;	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеНДПриИзменении(Элемент)
	НазначениеНДПриИзмененииНаСервере();
КонецПроцедуры
